# Taps
tap "git-friendly/git-friendly"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"

# CLI tools
brew "bat" # `cat` replacement
brew "eza" # `ls` replacement
brew "fastfetch" # Displays pretty system info
brew "fd" # `find` replacement
brew "fnm" # Node.js version manager
brew "fzf" # Fuzzy finder
brew "git"
brew "git-delta" # Diff pager for `git` and `grep` output
brew "lazygit" # Git client
brew "macos-trash" # `rm` replacement with MacOS trash support
brew "node" # Fallback Node.js version
brew "ripgrep" # `grep` replacement
brew "rsyncy" # `rsync` replacement
brew "starship" # Prompt manager
brew "tlrc" # `man` replacement
brew "typos-cli" # Fix typos
brew "zsh" # Shell
brew "zsh-syntax-highlighting"
brew "git-friendly/git-friendly/git-friendly" # Better Git commands

# GUI apps
cask "1password" # Password manager
cask "adobe-creative-cloud"
cask "alfred" # App launcher
cask "bruno" # GraphQL API client
cask "cleanshot" # Screenshots
cask "colorsnapper" # Color picker
cask "coteditor" # Simple code/text editor
cask "dash" # Documentation reader
cask "devtoys" # Collection of developer tools
cask "firefox"
cask "ghostty" # Terminal emulator
cask "github" # GitHub Desktop
cask "jordanbaird-ice" # Hides menu bar icons
cask "kap" # Video screen recording
cask "keka" # Archive reader
cask "mimestream" # Gmail client
cask "nimble-commander" # File manager
cask "notion"
cask "numi" # Calculator
cask "optimage" # Image optimization
cask "polypane" # Responsive design and accessibility testing
cask "quitter" # Quit apps after certain time
cask "replacicon" # Custom app icons
cask "telegram"
cask "visual-studio-code"
cask "vivaldi"
cask "wezterm" # Terminal emulator
cask "whatsapp"

# Fonts
cask "font-symbols-only-nerd-font"

# Visual Stuidio code extensions
vscode "astro-build.astro-vscode"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "dbaeumer.vscode-eslint"
vscode "deerawan.vscode-dash"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "fabiospampinato.vscode-open-in-github"
vscode "github.vscode-pull-request-github"
vscode "meganrogge.template-string-converter"
vscode "naumovs.color-highlight"
vscode "sapegin.emoji-console-log"
vscode "sapegin.just-blame"
vscode "sapegin.mini-markdown"
vscode "sapegin.new-file-now"
vscode "sapegin.notebox"
vscode "sapegin.reveal-in-ghostty"
vscode "sapegin.reveal-in-nimble-commander"
vscode "sapegin.theme-squirrelsonglight"
vscode "sapegin.todo-tomorrow"
vscode "sleistner.vscode-fileutils"
vscode "stkb.rewrap"
vscode "streetsidesoftware.code-spell-checker"

# TODO: Find a way to print this _after_ the installation, not before
puts "☕️ Install more apps if you need them:"
puts "brew install --cask charles"
puts "brew install --cask choosy"
puts "brew install --cask daisydisk"
puts "brew install --cask figma"
puts "brew install --cask gemini"
puts "brew install --cask messenger"
puts "brew install --cask rapidapi"
puts "brew install --cask slack"
puts "brew install --cask zoom"
puts ""
puts "🍏 Install additional apps from Mac App Store:"
puts "https://github.com/sapegin/dotfiles/wiki/OS-X-Apps"
puts ""
puts ""
