# Taps
tap "homebrew/bundle"
tap "homebrew/cask-fonts"

# CLI tools
brew "bat" # `cat` replacement
brew "exiftool" # EXIF reader
brew "eza" # `ls` replacement
brew "fastfetch" # Displays pretty system info
brew "fd" # `find` replacement
brew "fnm" # Node.js version manager
brew "fzf" # Fuzzy finder
brew "gh" # GitHub command-line tool
brew "gdu" # Disk usage analyzer
brew "git" # The Git
brew "git-delta" # Diff pager for `git` and `grep` output
brew "lazygit" # Git client
brew "macos-trash" # `rm` replacement with MacOS trash support
brew "node" # Fallback Node.js version
brew "ripgrep" # `grep` replacement
brew "rsyncy" # `rsync` replacement
brew "starship" # Prompt manager
brew "tlrc" # `man` replacement
brew "typos-cli" # Fix typos
brew "zsh" # Shell
brew "zsh-syntax-highlighting" # Syntax highlighting for zsh

# GUI apps
cask "adobe-creative-cloud" # Lightroom & Photoshop
cask "affinity" # Image editor
cask "alfred" # App launcher
cask "bruno" # REST/GraphQL API client
cask "choosy" # Browser selector
cask "cleanshot" # Screenshots
cask "colorsnapper" # Color picker
cask "coteditor" # Simple code/text editor
cask "dash" # Documentation reader
cask "firefox" # Main browser
cask "firefox@developer-edition"
cask "ghostty" # Terminal emulator
cask "github" # GitHub Desktop
cask "google-chrome" # Browser for testing
cask "jordanbaird-ice" # Hides menu bar icons
cask "kap" # Video screen recording
cask "keka" # Archive reader
cask "languagetool" # Spell checker
cask "nimble-commander" # File manager
cask "notion" # Collaborative notes
cask "numi" # Calculator
cask "obsidian" # Note taking
cask "optimage" # Image optimization
cask "polypane" # Responsive design and accessibility testing
cask "quitter" # Quit apps after certain time
cask "replacicon" # Custom app icons
cask "telegram" # Chat
cask "visual-studio-code" # Main code editor
cask "whatsapp" # Another chat

# Fonts
cask "font-symbols-only-nerd-font" # Nerd Font
cask "font-sf-pro" # Apple SF Pro

# Visual Studio Code extensions
vscode "astro-build.astro-vscode"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "dbaeumer.vscode-eslint"
vscode "deerawan.vscode-dash"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "meganrogge.template-string-converter"
vscode "naumovs.color-highlight"
vscode "nicksp.reveal-on-github"
vscode "sapegin.emoji-console-log"
vscode "sapegin.grim-wrapper"
vscode "sapegin.just-blame"
vscode "sapegin.mini-markdown"
vscode "sapegin.new-file-now"
vscode "sapegin.notebox"
vscode "sapegin.reveal-in-ghostty"
vscode "sapegin.reveal-in-nimble-commander"
vscode "sapegin.theme-squirrelsonglight"
vscode "sapegin.todo-tomorrow"
vscode "sleistner.vscode-fileutils"
vscode "streetsidesoftware.code-spell-checker"
vscode "tekumara.typos-vscode"
vscode "uooobarry.githubdesktop-open"

# TODO: Find a way to print this _after_ the installation, not before
puts "☕️ Install more apps if you need them:"
puts "brew install --cask charles"
puts "brew install --cask fastmail"
puts "brew install --cask figma"
puts "brew install --cask slack"
puts "brew install --cask zoom"
puts ""
puts "🍏 Install additional apps from Mac App Store:"
puts "https://github.com/sapegin/dotfiles/wiki/OS-X-Apps"
puts ""
puts ""
